INSERT INTO product (name, price) VALUES
('Товар 1', 10.99),
('Товар 2', 20.49),
('Товар 3', 15.99),
('Товар 4', 7.99),
('Товар 5', 25.00),
('Товар 6', 30.50),
('Товар 7', 22.99),
('Товар 8', 18.75),
('Товар 9', 19.99),
('Товар 10', 12.49);

INSERT INTO counterparty (first_name, last_name, phone, email) VALUES
('Иван', 'Иванов', '+7 (910) 123-45-67', 'IvanI@mail.ru'),
('Мария', 'Петрова', '+7 (925) 234-56-78', 'MariaP@mail.ru'),
('Алексей', 'Сидоров', '+7 (916) 345-67-89', 'AlexeyS@mail.ru'),
('Елена', 'Кузнецова', '+7 (915) 456-78-90', 'ElenaK@mail.ru'),
('Сергей', 'Попов', '+7 (926) 567-89-01', 'SergeyP@mail.ru'),
('Анна', 'Волкова', '+7 (929) 678-90-12', 'AnnaV@mail.ru'),
('Дмитрий', 'Морозов', '+7 (903) 789-01-23', 'DmitryM@mail.ru'),
('Ольга', 'Лебедева', '+7 (950) 890-12-34', 'OlgaL@mail.ru'),
('Владимир', 'Соловьев', '+7 (999) 901-23-45', 'VladimirS@mail.ru'),
('Наталья', 'Павлова', '+7 (951) 012-34-56', 'NatalyaP@mail.ru');

INSERT INTO document_header (document_number, counterparty_id, document_date, document_amount, document_type, document_status) VALUES
('DOC001', 1, '2024-01-01', 239.80, 'Приход', 'Черновик'),
('DOC002', 2, '2024-01-02', 612.46, 'Приход', 'Черновик'),
('DOC003', 3, '2024-01-03', 152.91, 'Приход', 'Оприходовано'),
('DOC004', 4, '2024-01-04', 449.50, 'Приход', 'Оприходовано'),
('DOC005', 5, '2024-01-05', 884.00, 'Резерв', 'Черновик'),
('DOC006', 6, '2024-01-06', 945.00, 'Резерв', 'Черновик'),
('DOC007', 7, '2024-01-07', 1253.47, 'Резерв', 'Зарезервировано'),
('DOC008', 8, '2024-01-08', 444.37, 'Резерв', 'Зарезервировано'),
('DOC009', 9, '2024-01-09', 314.85, 'Расход', 'Черновик'),
('DOC010', 10, '2024-01-10', 1286.87, 'Расход', 'Черновик'),
('DOC011', 1, '2024-01-11', 716.32, 'Расход', 'Списано'),
('DOC012', 2, '2024-01-12', 940.30, 'Расход', 'Списано');

INSERT INTO document_line (document_header_id, product_id, quantity, reserved_quantity, price, discount) VALUES
(1, 1, 20, 2, 11.99, 0),
(2, 2, 30, 3, 21.49, 5),
(3, 3, 10, 1, 16.99, 10),
(4, 4, 50, 5, 8.99, 0),
(5, 5, 40, 0, 26.00, 15),
(6, 6, 30, 0, 31.50, 0),
(7, 7, 55, 5, 23.99, 5),
(8, 8, 25, 2, 19.75, 10),
(9, 9, 15, 1, 20.99, 0),
(10, 10, 45, 4, 13.49, 5),
(11, 1, 35, 3, 11.99, 0),
(12, 2, 22, 2, 21.49, 10),
(10, 3, 44, 4, 16.99, 5),
(11, 4, 33, 3, 8.99, 0),
(12, 5, 22, 2, 26.00, 10);

INSERT INTO product_stock (product_id, actual_quantity, reserved_quantity) VALUES
(1, 100, 100),
(2, 200, 200),
(3, 220, 100),
(4, 180, 100),
(5, 260, 160),
(6, 150, 150),
(7, 400, 95),
(8, 270, 75),
(9, 200, 90),
(10, 110, 110);